; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		p e i n o g h t r s - block
	)
	(:init
		(handempty)
		(clear p)
		(on p e)
		(ontable e)
		(clear g)
		(on g n)
		(on n t)
		(on t h)
		(ontable h)
		(clear i)
		(on i o)
		(ontable o)
		(clear r)
		(ontable r)
		(clear s)
		(ontable s)
	)
	(:goal (and
		;; short
		(clear s) (ontable t) (on s h) (on h o) (on o r) (on r t)
	))
)

; plan
1. (unstack g n)
   deleted: (clear g) (handempty) (on g n)
   added: (holding g) (clear n)
   goals met: 1 of 6
2. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 1 of 6
3. (unstack n t)
   deleted: (clear n) (handempty) (on n t)
   added: (holding n) (clear t)
   goals met: 1 of 6
4. (stack n g)
   deleted: (holding n) (clear g)
   added: (clear n) (handempty) (on n g)
   goals met: 1 of 6
5. (unstack t h)
   deleted: (clear t) (handempty) (on t h)
   added: (holding t) (clear h)
   goals met: 1 of 6
6. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 2 of 6
7. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 2 of 6
8. (stack r t)
   deleted: (holding r) (clear t)
   added: (clear r) (handempty) (on r t)
   goals met: 3 of 6
9. (unstack i o)
   deleted: (clear i) (handempty) (on i o)
   added: (holding i) (clear o)
   goals met: 3 of 6
10. (stack i n)
   deleted: (holding i) (clear n)
   added: (clear i) (handempty) (on i n)
   goals met: 3 of 6
11. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 3 of 6
12. (stack o r)
   deleted: (holding o) (clear r)
   added: (clear o) (handempty) (on o r)
   goals met: 4 of 6
13. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 4 of 6
14. (stack h o)
   deleted: (holding h) (clear o)
   added: (clear h) (handempty) (on h o)
   goals met: 5 of 6
15. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 4 of 6
16. (stack s h)
   deleted: (holding s) (clear h)
   added: (clear s) (handempty) (on s h)
   goals met: 6 of 6
